OpenFOAM/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

surfaceFile "VI.stl";

renameBoundary{
	newPatchNames
	{

		inlet
		{
			newName inlet;
			type patch;
		}

		conversion
		{
			newName conversion;
			type wall;
		}

		conv_to_nozzle
		{
			newName conv_to_nozzle;
			type wall;
		}

		nozzle
		{
			newName nozzle;
			type wall;
		}

		nozzle_bottom
		{
			newName nozzle_bottom;
			type wall;
		}
		nozzle_out
		{
			newName nozzle_out;
			type wall;
		}
		major_top
		{
			newName major_top;
			type wall;
		}
		major_side
		{
			newName major_side;
			type wall;
		}
		majorOut_out
		{
			newName majorOut_out;
			type wall;
		}
		majorOutlet
		{
			newName majorOutlet;
			type patch;
		}
		majorOut_in
		{
			newName majorOut_in;
			type wall;
		}
		majorOut_curve
		{
			newName majorOut_curve;
			type wall;
		}
		major_bottom
		{
			newName major_bottom;
			type wall;
		}
		recieving_out
		{
			newName recieving_out;
			type wall;
		}
		recieving_top
		{
			newName recieving_top;
			type wall;
		}
		recieving
		{
			newName recieving;
			type wall;
		}
		recieving_expand
		{
			newName recieving_expand;
			type wall;
		}
		minor_wall
		{
			newName minor_wall;
			type wall;
		}
		minorOutlet
		{
			newName minorOutlet;
			type patch;
		}
		axis
		{
			newName axis;
			type symmetryPlane;
		}

	}
}

/*
scale = 0.5 (or maxCellSize = 0.01) is sufficient if the nozzle diameter is > 0.014 inch
smaller value may be required if nozzle diameter is < 0.014 inch or supersonic flow
*/

scale 0.5; 

minMaxCellSize #calc "0.02*$scale";
maxCellSize $minMaxCellSize;


// boundary layer need refinement
boundaryLayers
{
	nLayers 4;
	thicknessRatio 1.;
}


// use this part to refine the classification part
// !!!!!!!!! check p0 and p1 !!!!!!!!!!!!

/*
fine1 #calc "0.5*$minMaxCellSize";
fine2 #calc "0.75*$minMaxCellSize";	

objectRefinements
{
	cylinder1
	{
		cellSize $fine1;
		type cone;
		p0 (0 -7 0);
		radius0 1;
		p1 (0 -2.5 0);
		radius1 1;
	}

	cylinder2
	{
		cellSize $fine2;
		type cone;
		p0 (0 -10 0);
		radius0 2.5;
		p1 (0 0 0);
		radius1 2.5;
	}

}
*/




// ************************************************************************* //
