OpenFOAM/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;


boundaryField
{
    inlet
    {
        type            fixedValue;
        value        uniform 300;
    }
    majorOutlet
    {
        type            zeroGradient;
    }
    minorOutlet
    {
        type            zeroGradient;
    }
    conversion
    {
        type            zeroGradient;
    }
    conv_to_nozzle
    {
        type            zeroGradient;
    }
    nozzle
    {
        type            zeroGradient;
    }

	nozzle_bottom
    {
        type            zeroGradient;
    }
	nozzle_out
    {
        type            zeroGradient;
    }
	major_top
    {
        type            zeroGradient;
    }
	major_side
    {
        type            zeroGradient;
    }
	majorOut_out
    {
        type            zeroGradient;
    }
	majorOut_in
    {
        type            zeroGradient;
    }
	majorOut_curve
    {
        type            zeroGradient;
    }								
	major_bottom
    {
        type            zeroGradient;
    }
	recieving_out
    {
        type            zeroGradient;
    }
	recieving_top
    {
        type            zeroGradient;
    }
	recieving
    {
        type            zeroGradient;
    }
	recieving_expand
    {
        type            zeroGradient;
    }
	minor_wall
    {
        type            zeroGradient;
    }
	axis
    {
		type symmetryPlane;
    }
	topEmptyFaces
	{
		type empty;
	}
	bottomEmptyFaces
	{
		type empty;
	}


 
}


// ************************************************************************* //
