OpenFOAM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.01;
        smoother        GaussSeidel;
    }


    pFinal
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0;
        smoother        GaussSeidel;
    }

    "(rho|U|k|omega|e)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0.05;
    }

// used in old SIMPLE method
/*    "(U|k|omega|e)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }*/

    "(rho|U|k|omega|e)Final"
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

PIMPLE
{
    transonic           yes;
    nOuterCorrectors 1;
    nCorrectors      5;
    nNonOrthogonalCorrectors 0;
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|e)"   1e-4;
    }

    nNonOrthogonalCorrectors 0;
    pMinFactor      0.4;
    pMaxFactor      1.5;
}

relaxationFactors
{
    equations
    {
        ".*"           1;
    }
}

/*relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.01;
    }
    equations
    {
        U               0.7;
        e               0.7;
        "(k|omega)"     0.7;
    }
}*/

