OpenFOAM/Allmesh.sh
cartesian2DMesh
transformPoints -scale "(1e-3 1e-3 1e-3)"

